// Завдання 5
// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt.
// Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.

// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну.
// Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.

// Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення
// 'У вашій країні доставка недоступна'.

// Нижче наведено список країн і вартість доставки.

// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів

console.log("Завдання 5");

const country = prompt("Введіть країну доставки у полі внизу");
console.log (country);
let cost;

const normaliseCountry = country.toLowerCase();
console.log(normaliseCountry);
let message;

switch (normaliseCountry) {
  case "китай":
    cost = 100;
    break;
  case "чилі":
    cost = 250;
    break;
  case "австралія":
    cost = 170;
    break;
  case "індія":
    cost = 80;
    break;
  case "ямайка":
    cost = 120;
    break;

  default:
    cost = 0;
    message = "У вашій країні доставка недоступна"
    console.log(message);
    break;
}

console.log(`Доставка в ${country} буде коштувати ${cost} кредитів`);
